@narendermann Your code works exactly as expected. 

```
 # ibm_is_security_group_rule.outbound_port22 will be created
  + resource "ibm_is_security_group_rule" "outbound_port22" {
      + direction   = "outbound"
      + group       = "r006-263ec385-adf1-4a0e-9be3-951d1f4d71ba"
      + id          = (known after apply)
      + ip_version  = "ipv4"
      + local       = "172.31.2.6"
      + protocol    = (known after apply)
      + related_crn = (known after apply)
      + remote      = (known after apply)
      + rule_id     = (known after apply)

      + tcp {
          + port_max = 22
          + port_min = 22
        }
    }

```

state

```
# ibm_is_security_group_rule.outbound_port22:
resource "ibm_is_security_group_rule" "outbound_port22" {
    direction   = "outbound"
    group       = "r006-263ec385-adf1-4a0e-9be3-951d1f4d71ba"
    id          = "r006-263ec385-adf1-4a0e-9be3-951d1f4d71ba.r006-5b348c05-751e-48aa-9042-ff35e4c47657"
    ip_version  = "ipv4"
    local       = "172.31.2.6"
    protocol    = "tcp"
    related_crn = "crn:v1:bluemix:public:is:us-south:a/7f75c7b025e54bc5635f754b2f888665::security-group:r006-263ec385-adf1-4a0e-9be3-951d1f4d71ba"
    remote      = "r006-53835575-e4ec-4674-891d-73800e5a0700"
    rule_id     = "r006-5b348c05-751e-48aa-9042-ff35e4c47657"

    tcp {
        port_max = 22
        port_min = 22
    }
}
```


Make sure you are using the latest provider version. This should be available from versions 1.64.0 and above.
https://registry.terraform.io/providers/IBM-Cloud/ibm/1.67.0/docs/resources/is_security_group_rule